class MeatInfoSource {
  final orders = ['소', '돼지'];
  final largeOrders_1 = ['안심', '등심', '채끝', '목심', '앞다리', '우둔', '설도', '양지', '사태', '갈비'];
  final largeOrders_2 = ['안심', '등심', '목심', '앞다리', '갈비', '삼겹살', '뒷다리'];

  final List<List<String>> tableData_1 = [
    ['안심살'],
    ['윗등심', '꽃등심', '아래등심', '살치살'],
    ['채끝살'],
    ['목심살'],
    ['꾸리살', '부채살', '앞다리살', '갈비덧살', '부채덮개살'],
    ['우둔살', '홍두깨살'],
    ['보섭살', '설깃살', '설깃머리살', '도가니살', '삼각살'],
    ['양지머리', '차돌박이', '업진살', '업진안살', '치마양지', '치마살', '앞치마살'],
    ['앞사태', '뒷사태', '뭉치사태'],
    ['본갈비', '꽃갈비', '참갈비', '갈빗살', '마구리', '토시살', '안창살', '제비추리'],
  ];

  final List<List<String>> tableData_2 = [
    ['안심살'],
    ['등심살', '등심덧살'],
    ['목심살'],
    ['앞다리살', '앞사태살', '항정살', '꾸리살', '부채살', '주걱살'],
    ['갈비', '갈비살', '마구리'],
    ['삼겹살', '갈매기살', '등갈비', '토시살', '오돌삼겹살'],
    ['볼기살', '설깃살', '도가니살', '홍두께살', '보섭살', '뒷사태살'],
  ];
}
